package com.example.mvvm.model

import com.example.mvvm.model.domain.Wisdom

class FakeApi {
    private val wisdomList = listOf<Wisdom>(
        Wisdom("سر النجاح هو الثبات على الهدف", "2021/7/22"),
        Wisdom(
            "اهتم بأن تحصل على ما تحبه، و الا ستكون مجبراً على ان تقبل ما تحصل عليه ",
            "2022/7/22"
        ),
        Wisdom(
            "سر النجاح في الحياة أن تواجه مصاعبها بثبات الطير في ثورة العاصفة",
            "2021/5/10"),
        Wisdom("الفكرة باختصار : ضع هدفاً ، و لا تتخل عنه حتى تحققه", "2021/2/12"),
        Wisdom("اذا لم نجد طريق النجاح فعلينا ان نبتكره", "2021/3/30"),
        Wisdom(
            "إذا لم تكن لديك الرغبة في المخاطرة في بعض الأحيان، فعليك أن ترضى بأن تكون شخصا عاديا.",
            "2019/10/28"
        ),
        Wisdom("إن النجاح هو محصلة اجتهادات صغيرة تتراكم يوماً بعد يوم",
            "2021/11/11"),
        Wisdom(
            " كن دائماً الاصدار الاول من نفسك ، و لا تكن الاصدار الثاني من احد آخر",
            "2020/9/25"
        ),
    )

    fun getWisdom(): Wisdom {
        val random = (Math.random() * wisdomList.size).toInt()
        return wisdomList[random]
    }
}